{
  "name": "Alek",
  "bio": "Soy un desarrollador full stack con 1 a침o de experiencia en entornos web. Disfruto y siento mucha motivaci칩n participando en soluciones que impliquen gran utilidad y con una muy buena presentaci칩n, como aplicaciones IoT y esencialmente dise침o web, usando herramientas como React, Next.js o Python. Mi mayor inspiraci칩n es contribuir a un objetivo con perspectiva, y con ello, aprender y formalizar mi panorama profesional a un punto concreto. Con ganas de esforzarme y aprender en el transcurso, estoy dispuesto a hacer grandes cosas.",
  "contacts": {
    "phone": "+34 642 80 05 89",
    "email": "aleksusob@gmail.com",
    "github": "https://github.com/aleknss",
    "twitter": "https://twitter.com/aleksuso",
    "linkedin": "https://www.linkedin.com/in/alek-suso-bondoc-b91b15294/",
    "location": "La Rioja"
  },
  "education": {
    "bach": {
      "modalidad": "Bachillerato de Ciencias",
      "grado": "IES Bartolom칠 Cossio",
      "ciudad": "Haro",
      "graduacion": "2023/06/01 00:00:00"
    },
    "fp": {
      "modalidad": "Desarrollo de Aplicaciones Multiplataformas",
      "grado": "Sagrado Coraz칩n Jesuitas",
      "ciudad": "Logro침o",
      "graduacion": "2025/06/01 00:00:00"
    }
  },
  "projects": [
    {
      "name": "L치mpara autosuficiente y automatizada",
      "link": "https://spoo.me/iot-alek",
      "logo": "arduino",
      "description": "Este proyecto surge como respuesta a una necesidad de renovar la iluminaci칩n del jard칤n tras unos cambios estructurales. Con inter칠s en la eficiencia energ칠tica y el respeto al medio ambiente, busqu칠 integrar un sistema de iluminaci칩n solar. Adem치s, tom칠 la oportunidad de adentrarme en el mundo del IoT, automatizando el sistema mediante sensores y dispositivos conectados, lo que me permiti칩 explorar nuevas tecnolog칤as y aplicar mis conocimientos en dise침o y programaci칩n de arquitecturas inteligentes.",
      "skills": ["Arduino", "Electr칩nica"]
    },
    {
      "name": "Ordenna",
      "link": "https://github.com/aleknss/TFG",
      "logo": "ordenna",
      "description": "Ordenna es un sistema de gesti칩n de inventarios autom치tico, accesible y de bajo coste, desarrollado como Trabajo de Fin de Grado. Utiliza una ESP32-CAM que toma fotos cenitales peri칩dicas de estanter칤as donde los art칤culos est치n marcados con pegatinas de colores (游댮游리游댯). Una aplicaci칩n en FastAPI (Python) con OpenCV analiza cada imagen para detectar, contar y clasificar los productos, almacenando los resultados de forma estructurada en una base de datos. La informaci칩n se muestra en una web con gr치ficos y acceso por usuarios para clientes. Est치 pensado para adaptarse desde almacenes de empresa hasta una despensa dom칠stica.",
      "skills": ["React", "FastAPI", "Tailwind CSS"]
    },
    {
      "name": "Notas Drag'n'Drop",
      "link": "https://github.com/aleknss/notas",
      "logo": "dnd",
      "description": "Proyecto de prueba para aprender a usar drag and drop con la librer칤a de React dnd-kit. Funcionalidades esperadas como guardado de notas, edici칩n, borrado, etc. Actualmente en desarrollo.",
      "skills": ["React", "Tailwind CSS"]
    }
  ],
  "experience": [
    {
      "from": 1709251200000,
      "to": 1717200000000,
      "company": "Standard Profil",
      "role": "Desarrollador de Aplicaciones Web",
      "logo": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Flookaside.fbsbx.com%2Flookaside%2Fcrawler%2Fmedia%2F%3Fmedia_id%3D286585020687520&f=1&nofb=1&ipt=0a56f91348eef696876641ff517dd902cd4f1ba0abb72de201e573fe1ad97256",
      "descriptions": [
        "Desarrollo de aplicaciones web de gesti칩n interna y visualizaci칩n/control de archivos con ASP.NET AJAX.",
        "Manejo y control de conexiones de bases de datos con SQL Server.",
        "Trabajo en equipo en proyectos duales."
      ]
    },
    {
      "from": 1735689600000,
      "to": 1748736000000,
      "company": "Standard Profil",
      "role": "Desarrollador de Aplicaciones Web",
      "logo": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Flookaside.fbsbx.com%2Flookaside%2Fcrawler%2Fmedia%2F%3Fmedia_id%3D286585020687520&f=1&nofb=1&ipt=0a56f91348eef696876641ff517dd902cd4f1ba0abb72de201e573fe1ad97256",
      "descriptions": [
        "Desarrollo de sistema de llamadas andon a tiempo real con ASP.NET AJAX e Ignition.",
        "Digitalizaci칩n de procesos tradicionales de partes de trabajo.",
        "Plantilla de visualizaci칩n de datos con l칩gica y de dise침o de prensas mec치nicas."
      ]
    }
  ],
  "participaciones": [
    {
      "name": "WordCamp 2025 Logro침o",
      "description": "Acud칤 a este evento con la ilusi칩n y el objetivo de conocer mucha gente nueva que me abri칩 los ojos en contenidos de programaci칩n web y tecnolog칤a hasta dise침o o marketing. Aprend칤 mucho en el transcurso con las conferencias y charlas con los asistentes del programa y con la comunidad de desarrolladores, no sin pas치rmelo bien, evidentemente.",
      "clave": "WC"
    },
    {
      "name": "Agentes del Cambio",
      "description": "Complet칠 el curso paralelo de Agentes del Cambio, una propuesta impulsada por el Gobierno de Espa침a y la Uni칩n Europea para la transici칩n de la digitalizaci칩n de PYMEs con un enfoque en la planificaci칩n de proyectos de desarrollo de marca empresarial digital. Aqu칤 aprend칤 esencialmente a gestionar bien un plan de an치lisis de puntos fuertes y d칠biles de una empresa y acciones que deben ser tomadas para satisfacer las necesidades del cliente y poder ser competitivos.",
      "clave": "ADC"
    },
    {
      "name": "Banco de Alimentos",
      "description": "No fue una experiencia de aprendizaje directamente relacionada con el trabajo, pero sent칤 una aportaci칩n indirecta a un objetivo que considero noble. Adem치s, me ayud칩 a abrir la mente y poder dar un paso adelante y sacar iniciativa a la hora de mostrar propuestas y razonar.",
      "clave": "BA"
    },
    {
      "name": "Hacka Retods",
      "description": "Terminamos finalistas con una propuesta diferente: HydroLoop, una soluci칩n de reciclaje de agua casero. Particip칠 con un equipo en una actividad de colaboraci칩n destinada a priorizar la resoluci칩n de un problema socioecon칩mico con la ayuda de la tecnolog칤a y la innovaci칩n. Lo fundamental de esta experiencia fue tener que idear un plan compatible con alguna o algunas de los 17 objetivos de desarrollo sostenible.",
      "clave": "HACK"
    }
  ]
}
